namespace consoleProject
{
    /*
     * ФИО студента: Туйгунов Александр Муслимович
     * номер варианта: 6
     * условие задачи (скопировать из листа задания): 
     * 1) Напишите приложение для логирования действий,
     * в котором общий процесс логирования будет определен через шаблонный метод,
     * а конкретные действия - в дочерних классах.
     * 2) Напишите приложение, где клиенты могут находиться
     * в различных состояниях (новый запрос, в процессе, решен, закрыт).
     * Интерфейс изменяется в зависимости от состояния запроса
     * 3) Создайте простое графическое приложение,
     * где пользователи могут рисовать фигуры (например, круги, квадраты)
     * и управлять ими через команды: "Добавить фигуру", "Удалить фигуру", "Переместить фигуру".
     */
    internal class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
}